{"product_type": "solar panel", "products": [{"asin": "B07KB6GHPX", "title": "LOOM SOLAR Panel 50 watt - 12 Volt Mono PERC, BIS Certified", "num_ratings": 1273, "ratings": null, "top_reviews": [{"user": "Ankit jha", "review_title": "best quality solar panel at best price", "review": "Your browser does not support HTML5 video.\nbest quality solar panel with 2.5 amp output . product quality is very good at a reasonable price . i use this panel to charge my 20ah battery"}, {"user": "Samrat maurya", "review_title": "India best solar panel loom solar.", "review": "Nic products and original mono pagal by loom solar and safe delvery.its very useful for where light shortage is to much.\nOverall good product."}, {"user": "sushil patil", "review_title": "Good quality and best price 😊", "review": "Very good product and I like quality this panel 😊"}, {"user": "vishwas", "review_title": "PERFECTION", "review": "I'm using this 50W mono-crystalline panel along with 12Ah SMF battery and luminous 10A charge controller\n\nwhen there is good sunlight panel gives about 2.3A at 19 volts , my battery gets fully charged within 4 hours, also im using four 5W led bulbs which can be used together for 6 hours. even in very cloudy situation panel provides around 5w.\n\nThis panel is a champ, thanks for providing such awesome product for reasonable prize"}, {"user": "Nitesh Kr Singh", "review_title": "Good Solar Panel", "review": "Using since last 2-3 month and it's working great.... highly recommend."}, {"user": "Jitesh Kumar", "review_title": "12v 50watt loom solar", "review": "guys not happy with the product. junction box one side clip broken in the package. and second no negative and positive terminal sticker in back side of solar panel. fram quality also not so good. and notice in mono panel all solar cells will be in black colour. but this 12v 50watt some cell in between is bule colour also. i am already using polycristilan loom solar 12v 10watt panel. it's build quality is good. tomorrow morning i will check the out put performance if panel is not performing well.i need to replace it. and with out terminal sticker positive and negative sticker panel is certified as qualit check ok. and before package . package team is not seen one junction box side clip is broken. remaining feedback i will share tomorrow. panel is working well output voltage is 21.03volt and out put current is 2.47amps at 10.30,am i am located in Chennai. and cloudy days and drissiling time panel is s give 19volt and 0.43amps. but still required qualit check not done ."}, {"user": "ASHIF ALI", "review_title": "Powerful solar panels", "review": "For my project I am using 50w loom solar panel 35ah new car battery 30a charge controller and 300w ac inverter for my tiny house 3 rooms without electricity everything is working fine."}, {"user": "Satheesh B.", "review_title": "Where is the manual?", "review": "There is no manual or any guide on how to connect a wire from the panel. When you dont give a wire from the panel, at least you should include a small manual on how to connect. Some small things makes huge difference..at least a video on the product page how to connect a wire into the panel junction box would be very helpful."}]}, {"asin": "B07JDHX79D", "title": "LOOM SOLAR190 Watt-12 Volt Mono Crystalline Panel (Pack of 2)", "num_ratings": 327, "ratings": null, "top_reviews": [{"user": "Pravat", "review_title": "Not As Expected.", "review": "Loom solar mentioned in the description that junction box for 180W panel is IP68 but actually IP65 junction box installed.\n\nThere is no mention of Temp coefficients(Tc) for Voc and Isc in the specification available in its site by which we can calculate the voltage drop and current rise with temperature rise.\n\nSpecification is not like a good brand Company. Customer service is also very poor. Want to return, sad thing is Self Ship.\n\nAfter one day full test the maximum current(Isc) becomes 8.5Amp out of 9.3Amp which is below the company claimed. The current was supposed to increase in the peak sun hours due to positive Tc of Current. But no such occurred.\n\nI am sharing the test report of my one day testing with compared to Vikram poly solar panel of 150W, Voc=22.58V, Isc=8.7Amp."}, {"user": "Ramesh Baliga", "review_title": "Mono or Poly?", "review": "Happy with the Loom Solar 180 watt Mono Crystalline Panels. Company claims generation of 9 amps per panel. I have found that my three panels are generating about 25 amps when sun is directly overhead and I think that it is very good. Past one month, I have saved about 90 units of power saving approximately Rs. 700/- During the day 0700 to 1600 Hrs, treadmill, TV, fan and lights are all on Solar. At present, I am Switching On & Off manually. Hope to add a Timer in the circuit soon. Good thing about Loom Solar is that, they sell mounting stand as well, enabling you to assemble the system yourself. Planning to add Two more 180 watt Panels soon."}, {"user": "RAJES", "review_title": "Below average product", "review": "The build quality is below average when compared to other brand like luminous. There are some visible scratches in the glass covering the module. The frame material is not good and it cannot withstand high wind for long years. The output current never touches the given 9.3amps. I tried all angles and every half an hour in bright sunlight. The maximum current given by the panel is 8.23. In my opinion it may not lasts longer than 5-6 years.\nAfter 15 days of use I get only 224 watts maximum during 12.45PM to 1.30PM when both panels are connected in parallel (Not 360 watts maximum). The maximum peak working current provided by both panels in parallel are 16.32 amps only i.e., 8.16 ampere for each panel. The efficiency is slightly lower than poly crystalline panels. So in my view mono crystalline panels are not better."}, {"user": "Muralidhar", "review_title": "very very very good product. good efficiency", "review": "very good product loom solar 180w panel. am connected my 150 ah one battery charging purpose, battery output 850 v a inverter..24h using only inverter power in my house. EB power not required. I am using 650 rupees charge controlle&4sqmm wires. me and my brother installation done. thank you Amazon given good product and service"}, {"user": "PSRAO", "review_title": "Not so great performance and build quality", "review": "I bought 2 mono crystalline panels of 180W each. It is specified that these panels work well in cloudy weather. Out of 360W on an average I noticed 50W these 2 panels producing that too when used MPPT charge controllers with DC wires. In Bangalore the rainy season we see sunlight rarely. Though it is producing energy entire day and not even equivalent to 1 unit (Kwh) of energy. So not so productive and efficient as expected. The build quality of frame as well not that much great and it is shaky for normal winds itself. So I need to see its performance on sunny day. Loom Solar packing is also not good, external cartons got damaged and even no thermocol filled inside to protect from movement and shock any. Shipment over road transport needs good packing."}, {"user": "RABI NARAYAN MISHRA", "review_title": "Best product.", "review": "Yesterday only I have connected the Solar panels. I could achieve up to 122 Watts due to bad weather. Nice.."}, {"user": "sreekanthmuthuvila", "review_title": "Good performance", "review": "Good performance. I am using 180W 2Pannels,150Ah Single battery, Exide 1050 VA Inveter& Microtek SMU charge controller.Working in good condition.Battery fully charged, SMU cut the KSEB line& working solar power"}, {"user": "Inderjit Singh from Atwal cheep Energy", "review_title": "Nice product", "review": "Voltage and amp is same as company declaration working very well up-to 10 hours. I use 180w+180w with 12v 32ah battery and i use 4 ceiling fan 1 aircooler and 100W light also for whole day I use 32ah battery because I don't need backup"}]}, {"asin": "B082HGNQ57", "title": "Luminous Solar Panel (165 watt) -  (Pack of 1)", "num_ratings": 45, "ratings": null, "top_reviews": [{"user": "ಗಣಿ", "review_title": "Recommended solar panel", "review": "Luminous solar panel gives electricity even with less sun light (even in cloudy season) . And I have tested this device for 2 weeks and it was performing well."}, {"user": "Rajesh Rao", "review_title": "MC4 connectors missing", "review": "Luminous's quality check is questionable:Shoddy work done in the finishing of the panel, with white paint on many parts of panel, missing MC4 connectors (bare wire left instead of connector ends). I wanted to return the product but the seller expects me to ship back the product, what a scam!\nI had a bad experience with Luminous solar inverter too recently, which had broken parts, paint on the wires and it did not work either."}, {"user": "Amazon Customer", "review_title": "Good", "review": "Workers good"}, {"user": "Montajul haque Ahmed", "review_title": "Yes", "review": "Good👍"}, {"user": "ABDUL ASEES.K", "review_title": "Good", "review": "Product quality and packing"}, {"user": "Ubedurrahaman", "review_title": "Solar", "review": "Best product...."}]}, {"asin": "B07JVX4PZT", "title": "LOOM SOLAR 20 Watt - 12 Volt Solar Panel for Home Lighting & Small Battery Charging", "num_ratings": 189, "ratings": null, "top_reviews": [{"user": "prasanna", "review_title": "Product as promised", "review": "The product is good and to the specifications as mentioned. The product does not come with any cables and you need to do the wiring yourself as required. Basic knowledge of wiring is required. The rating of this product is low for mobile and power bank chargings. if you intend to charge your cell phones and power banks do check the charger ratings and then buy the product according to the right capacity. I discovered it after buying so the charging is happening bit slow (about 10-15% in one hr between 1200 to 1600 hrs) but cannot complain as the product is as per specs. Please check the application and buy the right spec panel."}, {"user": "Jyoti", "review_title": "Best panel for a small setup", "review": "A 10A pwm and a 7ah vrla battery and 2 bulbs =12 and 7 w setup. Runs for the whole nights and charges during the day. Current measured at 930 AM September month in on a fairly sunny morning was 0.93 A. This is not short circuit measurement. Not recommended to measure SC measurement.\nBuild quality is good and sturdy. Nice packaging. Recommended panel for small purpose use."}, {"user": "George", "review_title": "Solar panel", "review": "Packing is not so good\n1 amp in peek time\nExcellent for 12v 7ah battery"}, {"user": "San Yadav", "review_title": "20 Watt solar Panel", "review": "Solar Panel is good.\nNice Packaging.\nWorking good\nGood for 12 volts battery Charge\nThis panel Produce 1.24 amp current."}, {"user": "Muralidhar", "review_title": "happy product.. happy service", "review": "very nice product. daily full charging my12v 12ah battery.. output load evening to morning light on12v 9w led fog lamp 2no.my next planning 180w 2no loom solar panels.. thank you Amazon"}, {"user": "justin d sangma", "review_title": "Very use ful.", "review": "Very good n easy to carry every where."}, {"user": "Sandi", "review_title": "Highly efficient loom solar panel", "review": "Very good product. Charging even on cloudy sky. Efficient and able to charge quickly. Aluminium frame is also of good quality. Only the junction box is made up of poor quality plastic. But the panel is working satisfactorily."}, {"user": "Souvik haldar", "review_title": "Great product.", "review": "Perfectly working. At peak time output voltage is 19V and current is 1A. Delivery is also fast and well packing."}]}, {"asin": "B07JX9RHQH", "title": "LOOM SOLAR 40 Watt - 12 Volt Solar Panel for Home Lighting & Small Battery Charging", "num_ratings": 244, "ratings": null, "top_reviews": [{"user": "PRODIP KUMAR GHOSH", "review_title": "LOOM SOLAR PANEL 40 WATT- 12 VOLT", "review": "I bought it through amazon . Delivery was in time. Material was in tact. I use it for 18 watt led tube light and 12 volt dc bulb. Domestic AC Tube light ,AC LED TV can be used through 12 volt dc to ac converter(220 volt). One 12 volt battery is necessary to get charge from sunlight. Process is 1. fix your solar panel in such a way so that it get regular sunlight throughout the day, 2. connect the wire positive and negative to solar panel on one end 3. connect the other end of the wire to the positive and negative battery. 4. connect positive and negative wire of converter to the positive and negative of the battery 5. connect tubelight wire to AC output of converter . otherwise DC bulb, dc tube can be connected directly to the wire coming from from solar panel without using battery and converter. I am happy using the solar panel in different ways. Do not use any ac fan through converter, it will not work. Thanks to Amazon."}, {"user": "Jamil", "review_title": "Good", "review": "It produces good amount of electricity. Just didnt read before ordering that its polycrystalline. Rest all is good."}, {"user": "Rakesh R.", "review_title": "Energy", "review": "Good energy..."}, {"user": "sujith", "review_title": "Poor service", "review": "One week working good but now current is too low.\nWe try to contact several times but they not respond\nPoor costomer service"}, {"user": "Prajith", "review_title": "Very good panel", "review": "Good panel it produce 2.10Amp current in sunny days and very good build quality value for money"}, {"user": "George", "review_title": "Best cell", "review": "Good product"}, {"user": "Salman", "review_title": "Go for it.i like this value for money.", "review": "Loom company provide verry good product.i am using it for 12v fan.it works well.also cloudy weather works.size big bit value for money.good for battery(12v) charge .dc fan.excellent product.i love this."}, {"user": "sathish kumar", "review_title": "Good quality product and reasonable price", "review": "Best built quality and secure packing.The panel will be protected with bypass diode."}]}, {"asin": "B07BFD88Z6", "title": "Microtek Solar Panel MTK 150Watt 12V", "num_ratings": 73, "ratings": null, "top_reviews": [{"user": "Raushan", "review_title": "Nice products but price is greater than market price", "review": "Nice"}, {"user": "Amazon Customer", "review_title": "Satisfied in all respects.", "review": "Panel is in good condition and giving it's maximum output .Delivery was also very prompt and delivered in time with good condition in best packaging .I am happy with this product"}, {"user": "maidul islam", "review_title": "Maidul", "review": "Super product & amazon"}, {"user": "Siddhartha R.", "review_title": "Not so good", "review": "Not so good."}, {"user": "Shiva", "review_title": "Good.. Go for it.👌👌👍👍", "review": "I have buy 4 Panels working good👌👌\nDelivered on time.\nPackaging is good.👍👍👍"}, {"user": "B Das", "review_title": "Great panels", "review": "Good product. I have got output of more than 8 amps per panel. Average output of 2.9Kwh with 3 panels daily over three months."}, {"user": "Dhananjaya", "review_title": "Convient to nature.", "review": "Was delivered in good condition and works.\nEasy way to be gentle on the environment."}, {"user": "Veeresh Nishad", "review_title": "Very nice product", "review": "Very good product. On time delivery by Amazon. Very good packing. This is 150 watt 12 volt solar panel. Performance is good. Go for it."}]}, {"asin": "B01618INSA", "title": "Sukam Solar Panel 100 Watt - 12V", "num_ratings": 206, "ratings": null, "top_reviews": [{"user": "Buyer", "review_title": "but Good quality No Fear to buy this panel for this ...", "review": "Average in packing.. but Good quality No Fear to buy this panel for this cost. Overall Gud quality.."}, {"user": "STS", "review_title": "Good quality.", "review": "Dunno what happened to it, haven't seen it for a long time, it's lying out in the sun and just works and works and works."}, {"user": "hem chandra", "review_title": "Hardboard supported packing is needed to save the panel.", "review": "Packing can be more better if hardboard or full foam can be provided. As its back side got one cut of 2 cm size. Hope it will not affect the performance of this solar panel."}, {"user": "Subhadeep Chowdhury", "review_title": "A good product but needs care", "review": "Your browser does not support HTML5 video.\nI jave purchased this piece few months back and it's working perfectly right now. The voltage is upto the mark as described though I have some doubts with the amps. Mine is 10 amp but I really think there are some issue with the load. Might be my battery is the culprit as well. Overall it's very good product.\n\nLogistics: As it is a very delicate product, the logistics need to be more careful. The first delivery I got was completely broken. Amazon, kindly look into the logistics of this product as I suppose it was delivered to me from amazon's warehouse. Kindly educate your people to handle fragile products carefully and properly."}, {"user": "Kalyan p.", "review_title": "Good", "review": "Good .. voltage provide"}, {"user": "Amazon Customer", "review_title": "It should have been packed in a better way to protect the glass.", "review": "I received the panel with the glass completely shattered."}, {"user": "Binit T.", "review_title": "Somehow", "review": "Nice charging. Packaging need to improve. My panel damage at the frame"}, {"user": "Amazon Customer", "review_title": "Very efficient output", "review": "In best sunny days it is giving 85% output. I encourage everyone to go for environmental friendly energy solutions. SUKAM is doing a great job."}]}, {"asin": "B07Q1674LW", "title": "Electronicspices 6V 100MA MINI SOLAR PANEL wire attached with solar for DIY Square shape (70x70x3 mm)", "num_ratings": 423, "ratings": null, "top_reviews": [{"user": "Kartik tyagi", "review_title": "ausm", "review": "most amazing product this solar panel is totally correct gives 100 mah current and 6v please go for this panel"}, {"user": "Amazon Customer", "review_title": "Osm", "review": "Brought for my college project.good packing,working,handling,glowing(led),"}, {"user": "Shankar", "review_title": "Good product", "review": "Good product good work"}, {"user": "Kavish", "review_title": "Not as per specs", "review": "Not able to a 3 v motor together"}, {"user": "Nithin", "review_title": "Fake product and Poor quality in soldering area very fragile soldering", "review": "Fake product no proper voltage and amp no quality wire soldering is easy breakable parts not pcb type soldering cheating customers 25 pic orders nothing properly working"}, {"user": "ravindar", "review_title": "Don't purchase by seeing Amazon suggestions.", "review": "I was booked by seeing suggestions of Amazon.\nActually I was intrested to purchase a a small dc motor. When I am booking to purchase that motor . Amazon app was suggested to choose this pannel to purchase parallel.\nBut it was not suitable to that motor.\nIt's a 6v output.\nMotor need 12v input\nBut a wrong suggestions was given by Amazon.\nIt's not useful to my product but it's working good."}, {"user": "Anil Mishra", "review_title": "Provide a booklet with every single product.", "review": "Your products are good, no question but please provide a BOOKLET so the customer can not only satisfy but also understand how to use, and if any problem arises the customer get repaired it by own or others. Therefore it will let you to good progress. Thanks"}, {"user": "Ganesh", "review_title": "Very nice and innovative product", "review": "Convert the Light into electric volt...it lits one LED bulbat minimal indoor condition .....conversion rate is very good"}]}, {"asin": "B07XH546NL", "title": "Electronicspices 6V 100mA Wire Attached Mini Power Solar Cells for Solar Panels, DIY Projects (Multicolour, 70 x 70 mm)", "num_ratings": 49, "ratings": null, "top_reviews": [{"user": "Gaurav Dahiya", "review_title": "No wire, fake description", "review": "The panel does not come with any wire, attached or otherwise. Wrong description. The only connection point in back is a paper thin and very soft metal strip and as the backside of the panel is plastic, I don't know how I will be able to solder even."}, {"user": "ElectroLight", "review_title": "Wow", "review": "This is amazing I have ordered the same product a year ago at that time it was working like a charm and this time I have the trust that it will also work And it works! I have made a solar charger with it .it was superb.Thanks Electronicspices 😃😃👍☺️ ."}, {"user": "Kiran", "review_title": "price tag should tag should be minimum.", "review": "Gadget good."}, {"user": "Mahaveer Singh(MV)", "review_title": "BAD", "review": "BAD"}, {"user": "Shreekanth", "review_title": "Tiny one but huge power", "review": "It's really value for money"}, {"user": "Bideshi sethi", "review_title": "Solar panel for charging mobile", "review": "Best this is real 6v Solar panel ,I\nSearch\nI say to all Amazon customers to buy this"}, {"user": "Amazon Customer", "review_title": "Good Quality and free LED BULB Thanx Sellar, i am also buy other products from this Seller", "review": "NIce Product with long Wire and two LED Bulb Free Thanx Seller"}, {"user": "Md Gouse", "review_title": "Bad product", "review": "Not working"}]}, {"asin": "B08DLYKTWZ", "title": "D'Mak 20 Watt Waterproof Solar Led Street with Integrated Solar Panel for Outdoor Purposes", "num_ratings": 3, "ratings": null, "top_reviews": [{"user": "shiddu hombal", "review_title": "Solar straight light", "review": "Product is not good"}, {"user": "Gowtham. G", "review_title": "Check the product before u send to the customer", "review": "It's not working ,I received only the light"}]}, {"asin": "B07VN3TDC7", "title": "ERH INDIA 6V 100MA Mini Solar Panel Wire Attached with Solar for DIY Square Shape (70x70x3 mm)", "num_ratings": 11, "ratings": null, "top_reviews": [{"user": "Avinash anumeh", "review_title": "2 Rs product", "review": "Your browser does not support HTML5 video.\nThe seller lie. It says 100mA. But the product is 70 mA. See photo."}, {"user": "dipak Sharma", "review_title": "Good", "review": "Bhut hi acha h us krna bhi Aasan hai☺"}, {"user": "Amit Sharma", "review_title": "Not same as promised in description", "review": "Not upto expectations, output is less even on full sunny day"}, {"user": "shubham", "review_title": "Awesome", "review": "Good product max output 4 volt"}]}, {"asin": "B08RXYSZRD", "title": "ERH India (Pack of 10) Solar for DIY Square Shape Mini Solar Panel 6V-100 mAh (70 x 70 x 03 mm)", "num_ratings": 7, "ratings": null, "top_reviews": [{"user": "Sanu S.", "review_title": "Some solars are damaged or un finished", "review": "Your browser does not support HTML5 video.\nAll items are works we check voltage for best solar light we get 7v. Some solar panels not solder well. I can use that so we not go for return"}, {"user": "Virendra yadav", "review_title": "Nice", "review": "Very good product"}]}]}